EDT/ZUP/zup_edt/src/InformationRegisters/СогласованиеВакансий/СогласованиеВакансий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СогласованиеВакансий</name>
  <resources>
    <name>СостояниеСогласования</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </resources>
  <resources>
    <name>Рассмотрел</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРассмотрения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритет</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяПозиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>DefinedType.ВакансияСогласования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/Documents/ЗаявкаНаПодборПерсонала/ЗаявкаНаПодборПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПодборПерсонала</name>
  <basedOn>Catalog.ПрофилиДолжностей</basedOn>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетПрофилюДолжности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемыйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритет</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытия</name>
    <type>
      <types>CatalogRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСостояние</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРассмотрел</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаРассмотрения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНабора</name>
    <type>
      <types>EnumRef.СпособНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНабора</name>
    <type>
      <types>EnumRef.НазначениеНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяПозиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПроверка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяОбучение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияСотрудников</name>
    <attributes>
      <name>ДействиеСотрудника</name>
      <type>
        <types>CatalogRef.ДействияСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/Catalogs/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вакансии</name>
  <basedOn>Document.ЗаявкаНаПодборПерсонала</basedOn>
  <basedOn>Catalog.ПрофилиДолжностей</basedOn>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемыйДоход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаЗакрытия</name>
    <comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется на более лаконичный</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСостояние</name>
    <type>
      <types>EnumRef.СостоянияВакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаСостояния</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПодборПерсонала</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <comment>АПК:58 Имя не меняется для сохранения совместимости, синоним меняется для единообразия с заявкой в форме «Согласование вакансий»</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетПрофилюДолжности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.Приоритет</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытия</name>
    <type>
      <types>CatalogRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНабора</name>
    <type>
      <types>EnumRef.СпособНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеНабора</name>
    <type>
      <types>EnumRef.НазначениеНабораПерсоналаНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>НоваяПозиция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикиПерсонала</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ХарактеристикиПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяПроверка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяОбучение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДействияСотрудников</name>
    <attributes>
      <name>ДействиеСотрудника</name>
      <type>
        <types>CatalogRef.ДействияСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРаботыСКандидатами</name>
    <attributes>
      <name>ЭтапРаботы</name>
      <type>
        <types>CatalogRef.ЭтапыРаботыСКандидатами</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонАнкеты</name>
      <type>
        <types>CatalogRef.ШаблоныАнкет</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/ZUP/zup_edt/src/InformationRegisters/СогласованиеВакансий/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура СогласоватьДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	СогласованныеВакансии = УстановитьСостояниеСогласования(Параметры.Вакансии, Перечисления.СостоянияСогласования.Согласовано);
	
	ПоместитьВоВременноеХранилище(СогласованныеВакансии, АдресРезультата);
	
КонецПроцедуры

Процедура ОтклонитьДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	ОтклоненныеВакансии = УстановитьСостояниеСогласования(Параметры.Вакансии, Перечисления.СостоянияСогласования.Отклонено);
	
	ПоместитьВоВременноеХранилище(ОтклоненныеВакансии, АдресРезультата);
	
КонецПроцедуры

Процедура ОтменитьРешениеДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	ОбработанныеВакансии = УстановитьСостояниеСогласования(Параметры.Вакансии, Перечисления.СостоянияСогласования.Рассматривается);
	
	ПоместитьВоВременноеХранилище(ОбработанныеВакансии, АдресРезультата);
	
КонецПроцедуры

Функция УстановитьСостояниеСогласования(Вакансии, Состояние)
	
	Обработанные = Новый Массив;
	
	Для Каждого ВакансияЗаявка Из Вакансии Цикл
		ВакансияОбъект = ВакансияЗаявка.ПолучитьОбъект();
		ПроверитьУстановкуСостояния(ВакансияОбъект, Состояние);
		Если Не НачатьУстановкуСостояния(ВакансияЗаявка, Состояние) Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			УстановитьСостояниеСогласованияВакансии(ВакансияОбъект, Состояние);
			ЗавершитьУстановкуСостояния();
		Исключение
			ОтменитьУстановкуСостояния();
			ЗарегистрироватьОшибкуУстановкиСостояния(ИнформацияОбОшибке(), ВакансияОбъект.Ссылка, Состояние, Ложь);
			ВызватьИсключение;
		КонецПопытки;
		Обработанные.Добавить(ВакансияЗаявка);
	КонецЦикла;
	
	Возврат Обработанные;
	
КонецФункции

// АПК:326-выкл. АПК "не видит", что транзакция на самом деле фиксируется в методе ЗавершитьУстановкуСостояния.
// АПК:325-выкл. АПК "не видит", что фиксируется транзакция, открытая в НачатьУстановкуСостояния.

Функция НачатьУстановкуСостояния(ВакансияСсылка, Состояние)
	
	БлокировкаДанных = Новый БлокировкаДанных();
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.СогласованиеВакансий");
	ЭлементБлокировки.УстановитьЗначение("Вакансия", ВакансияСсылка);
	
	НачатьТранзакцию();
	
	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение
		ОтменитьУстановкуСостояния();
		ЗарегистрироватьОшибкуУстановкиСостояния(ИнформацияОбОшибке(), ВакансияСсылка.Ссылка, Состояние);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗавершитьУстановкуСостояния()
	ЗафиксироватьТранзакцию();
КонецПроцедуры

Процедура ОтменитьУстановкуСостояния()
	ОтменитьТранзакцию();
КонецПроцедуры

// АПК:326-вкл.
// АПК:325-вкл.

Процедура ПроверитьУстановкуСостояния(ВакансияОбъект, Состояние)
	
	Если Состояние <> Перечисления.СостоянияСогласования.Согласовано Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ВакансияОбъект.ПроверитьЗаполнение() Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось согласовать %1, ошибка проверки заполнения.'"),
			ВакансияОбъект.Ссылка);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСостояниеСогласованияВакансии(ВакансияОбъект, Состояние)
	
	ТребуетсяСогласование = Истина;
	
	НаборЗаписей = РегистрыСведений.СогласованиеВакансий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Вакансия.Установить(ВакансияОбъект.Ссылка);
	
	ДанныеСогласования = НаборЗаписей.Добавить();
	
	СогласованиеВакансий.ЗаполнитьДанныеСогласованияВакансии(ВакансияОбъект, ДанныеСогласования, ТребуетсяСогласование);
	
	Если Не ТребуетсяСогласование Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Вакансия %1 не требует согласования.'"),
			ВакансияОбъект.Ссылка);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ДанныеСогласования.СостояниеСогласования = Состояние;
	ДанныеСогласования.Рассмотрел = Пользователи.ТекущийПользователь();
	ДанныеСогласования.ДатаРассмотрения = ТекущаяДатаСеанса();
	
	СогласованиеВакансий.ПриУстановкеСостоянияСогласованияВакансии(ВакансияОбъект, ДанныеСогласования);
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибкуУстановкиСостояния(ИнформацияОбОшибке, ОбъектСсылка, Состояние, ПоказыватьСообщения = Истина)
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось обработать %1 по причине:
              |%2'"),
		ОбъектСсылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Согласование вакансий.'", ОбщегоНазначения.КодОсновногоЯзыка()) + Строка(Состояние), 
		УровеньЖурналаРегистрации.Ошибка, 
		ОбъектСсылка.Метаданные(),
		ОбъектСсылка,
		ТекстСообщения);
		
	Если ПоказыватьСообщения Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

Процедура ЗаполнитьСведенияСогласования(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	Заявки.Ссылка КАК Вакансия,
		|	Заявки.Дата КАК Дата,
		|	Заявки.УдалитьСостояние КАК СостояниеСогласования,
		|	Заявки.УдалитьРассмотрел КАК Рассмотрел,
		|	Заявки.УдалитьДатаРассмотрения КАК ДатаРассмотрения
		|ИЗ
		|	Документ.ЗаявкаНаПодборПерсонала КАК Заявки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласованиеВакансий КАК СогласованиеВакансий
		|		ПО (СогласованиеВакансий.Вакансия = Заявки.Ссылка)
		|ГДЕ
		|	СогласованиеВакансий.Вакансия ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 100
		|	Вакансии.Ссылка,
		|	Вакансии.ДатаОткрытия,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласованиеВакансий КАК СогласованиеВакансий
		|		ПО (СогласованиеВакансий.Вакансия = Вакансии.Ссылка)
		|ГДЕ
		|	Вакансии.Основание = ЗНАЧЕНИЕ(Документ.ЗаявкаНаПодборПерсонала.ПустаяСсылка)
		|	И СогласованиеВакансий.Вакансия ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
				ПараметрыОбновления, 
				"РегистрСведений.СогласованиеВакансий", 
				"Вакансия", 
				Выборка.Вакансия) Тогда
			Продолжить;
		КонецЕсли;
		ТребуетсяСогласование = Истина;
		ОбъектСогласования = Выборка.Вакансия.ПолучитьОбъект();
		НаборЗаписей = РегистрыСведений.СогласованиеВакансий.СоздатьНаборЗаписей();
		ДанныеСогласования = НаборЗаписей.Добавить();
		СогласованиеВакансий.ЗаполнитьДанныеСогласованияВакансии(ОбъектСогласования, ДанныеСогласования, ТребуетсяСогласование);
		Если ЗначениеЗаполнено(Выборка.СостояниеСогласования) Тогда
			ЗаполнитьЗначенияСвойств(ДанныеСогласования, Выборка);
		КонецЕсли;
		НаборЗаписей.Отбор.Вакансия.Установить(Выборка.Вакансия);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
